; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared0 - mode
	image1 - mode
	Star7 - direction
	Star6 - direction
	Star4 - direction
	GroundStation3 - direction
	Star1 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star2 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star4)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument6 infrared0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation8)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star16)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation8)
)
(:goal (and
	(pointing satellite0 Planet14)
	(pointing satellite1 Star16)
	(pointing satellite5 GroundStation3)
	(have_image Star10 infrared0)
	(have_image Star11 image1)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 infrared0)
	(have_image Planet14 image1)
	(have_image Planet15 infrared0)
	(have_image Star16 infrared0)
))

)

; plan
1. (turn_to satellite5 groundstation3 groundstation8)
   deleted: (pointing satellite5 groundstation8)
   added: (pointing satellite5 groundstation3)
   goals met: 1 of 10
2. (turn_to satellite1 star16 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star16)
   goals met: 2 of 10
3. (turn_to satellite0 groundstation5 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 10
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
5. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 2 of 10
6. (turn_to satellite0 planet15 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet15)
   goals met: 2 of 10
7. (take_image satellite0 planet15 instrument1 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 3 of 10
8. (turn_to satellite0 phenomenon13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 10
9. (take_image satellite0 phenomenon13 instrument1 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 4 of 10
10. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 10
11. (take_image satellite0 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 5 of 10
12. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 5 of 10
13. (take_image satellite0 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 10
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
15. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 7 of 10
16. (turn_to satellite0 star16 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star16)
   goals met: 7 of 10
17. (take_image satellite0 star16 instrument1 infrared0)
   added: (have_image star16 infrared0)
   goals met: 8 of 10
18. (turn_to satellite0 planet14 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet14)
   goals met: 9 of 10
19. (take_image satellite0 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 10 of 10
